# 给你一个二维整数数组 points，其中 points[i] = [xi, yi] 表示第 i 个点在笛卡尔平面上的坐标。
# 返回可以从 points 中任意选择四个不同点组成的梯形的数量。
# 梯形 是一种凸四边形，具有 至少一对 平行边。两条直线平行当且仅当它们的斜率相同。
 

# 示例 1：
# 输入： points = [[-3,2],[3,0],[2,3],[3,2],[2,-3]]
# 输出： 2
# 解释：
# 有两种不同方式选择四个点组成一个梯形：
# 点 [-3,2], [2,3], [3,2], [2,-3] 组成一个梯形。
# 点 [2,3], [3,2], [3,0], [2,-3] 组成另一个梯形。

# 示例 2：
# 输入： points = [[0,0],[1,0],[0,1],[2,1]]
# 输出： 1
# 解释：
# 只有一种方式可以组成一个梯形。

 
# 提示：
# 4 <= points.length <= 500
# –1000 <= xi, yi <= 1000
# 所有点两两不同。

# Hard

from collections import Counter, defaultdict
from math import gcd, inf
from typing import List

class Solution:
    def countTrapezoids(self, points: List[List[int]]) -> int:
        n = len(points)
        slopeBucket = defaultdict(list)
        mid2Slope = defaultdict(list) # 记录相同中点不同斜率的斜率数
        for i in range(n):
            xi, yi = points[i]
            for j in range(i+1, n):
                xj, yj = points[j]
                # 计算每一对点的斜率（化简+统一）
                dx, dy = xj - xi, yj - yi
                g = gcd(dx, dy)
                dx, dy = dx // g, dy // g
                if dx < 0:
                    dx, dy = -dx, -dy # 将d统一转为正值
                if dx == 0:
                    dy = 1
                elif dy == 0:
                    dx = 1

                bias = yi * dx - dy * xi
                mid = (xi + xj, yi + yj)
                
                slopeBucket[(dx, dy)].append(bias)
                mid2Slope[mid].append((dx, dy))

        res = 0
        # 斜率相同的点对，其所在直线有不同的截距，只要截距不同的点对，是可以组成梯形的
        for b in slopeBucket.values():
            if len(b) == 1:
                continue

            cnt = Counter(b)
            s = 0
            for c in cnt.values():
                res += s * c
                s += c


        for m2s in mid2Slope.values():
            if len(m2s) == 1:
                continue

            cnt = Counter(m2s)
            s = 0
            for c in cnt.values():
                res -= s * c
                s += c
        
        return res

        
if __name__ == "__main__":
    solution = Solution()
    print(solution.countTrapezoids([[209,-385],[-35,319],[379,-93],[452,10],[179,163],[-118,196],[430,-365],[179,-365],[-299,465],[209,-410],[-375,-403],[-163,-227],[77,-365],[268,441],[460,465],[-163,465],[-412,-267],[-412,53],[-46,-280],[61,-209],[-234,32],[-35,296],[-276,-93],[-412,-475],[-470,-181],[-412,-283],[367,175],[-371,218],[209,-79],[-226,-74],[-435,-410],[-80,10],[-433,-365],[-35,-93],[-470,-67],[-378,0],[-82,-331],[144,268],[449,-106],[-470,-28],[452,-370],[449,-204],[-96,-245],[195,465],[-353,422],[-265,-2],[-178,219],[-35,222],[-375,-411],[-118,-93],[-199,71],[49,-209],[-301,-276],[79,219],[-46,32],[-35,181],[435,402],[449,465],[321,-209],[-412,148],[187,465],[367,496],[16,101],[179,244],[-346,151],[-353,319],[-251,-106],[-35,119],[-118,-370],[-102,465],[-35,311],[452,-62],[-118,441],[-412,-259],[375,441],[483,-182],[-35,-471],[462,289],[179,465],[-412,344],[206,302],[449,417],[-25,500],[-118,43],[372,-93],[180,167],[-118,473],[106,144],[151,-370],[-375,-245],[77,-399],[-478,465],[-405,-478],[-25,-291],[359,-347],[-371,-410],[179,250],[-353,206],[414,-494],[-118,-245],[-199,465],[28,-127],[435,175],[187,-436],[209,-250],[-35,-28],[-35,219],[-257,-93],[-25,-24],[-35,-236]])) # 11025
    # print(solution.countTrapezoids([[71,-89],[-75,-89],[-9,11],[-24,-89],[-51,-89],[-77,-89],[42,11]])) # 10
    # print(solution.countTrapezoids([[-3,2],[3,0],[2,3],[3,2],[2,-3]])) # 2
    # print(solution.countTrapezoids([[0,0],[1,0],[0,1],[2,1]])) # 1
